1c/Documents/МИКО_аиЗадачаНаОбзвон.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>МИКО_аиЗадачаНаОбзвон</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВнутреннийНомер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МИКО_аиОпросы</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЗадачи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеЗадачи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальноеЧислоКаналов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>timeCallAllow</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>timeStart</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>timeEnd</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоРасписанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>attemptUntilSignal</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>maxAttempt</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>tryInterval</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбновлятьСтатистикуНаФорме</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НомераТелефонов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>32</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Клиент</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>phoneId</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>32</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>timeCallAllow</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПараметSpeach</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПараметSpeach1</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПараметSpeach2</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1c/InformationRegisters/МИКО_аиРезультатыЗадачОбзвона.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>МИКО_аиРезультатыЗадачОбзвона</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>taskId</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>phone</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>linkedId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>callFile</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>result</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>outDialState</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>inDialState</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>state</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>verboseCallId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>cause</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>changeTime</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>32</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>closeTime</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Успешный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.МИКО_аиЗадачаНаОбзвон</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>phoneId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>attemptNumber</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1c/Documents/МИКО_аиЗадачаНаОбзвон/Forms/ФормаДокументаУправляемая/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	Элементы.грРасписаниеCЭлементы.Видимость = Объект.ПоРасписанию;

	Если НЕ ЗначениеЗаполнено(Объект.ВерсияДанных)  Тогда  
		Объект.maxAttempt = 1;
		Объект.tryInterval = 60;
		Объект.attemptUntilSignal = Ложь;
		Возврат;	
	КонецЕсли; 
	ОбновитьСтатистикуПоЗвонку(Истина);

	//ДанныеЗадачи = МИКО_аиAPI.ПолучитьДанныеЗадачи(Объект.ИдентификаторЗадачи);
	//Если НЕ ДанныеЗадачи.result Тогда
	// 	Возврат;
	//КонецЕсли;

	//Для каждого НомерКОбзвону Из ДанныеЗадачи.data.results Цикл
	//	ДанныеНомера = Объект.НомераТелефонов.НайтиСтроки(Новый Структура("phoneId",НомерКОбзвону.phoneId));
	//	Если ДанныеНомера.Количество()=0 Тогда
	//	 	Продолжить;
	//	КонецЕсли;	
	//	Закрыта 		= НомерКОбзвону.closeTime <> "0";
	//	НачатаОбработка = НомерКОбзвону.state <> "CreateTask";
	//	Если Закрыта Тогда
	//		ДанныеНомера[0].Статус = "Отработан";
	//	ИначеЕсли НачатаОбработка Тогда 	
	//		ДанныеНомера[0].Статус = "Вызов...";  
	//	Иначе
	//		ДанныеНомера[0].Статус = "";  
	//	КонецЕсли;
	//КонецЦикла;
КонецПроцедуры 

&НаКлиенте
Процедура ОбновитьСтатистикуПоЗвонкуКлиент() Экспорт

	ОбновитьСтатистикуПоЗвонку();	

КонецПроцедуры // ОбновитьСтатистикуПоЗвонку()

&НаСервере
Процедура ОбновитьСтатистикуПоЗвонку(РучнойЗапуск = Ложь)
	Если НЕ (РучнойЗапуск ИЛИ Объект.ОбновлятьСтатистикуНаФорме) Тогда
		Возврат;
	КонецЕсли;
    МИКО_аиСинхронизация.СонхронизацияЗадач();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МИКО_аиРезультатыЗадачОбзвона.Задача КАК Задача,
		|	МИКО_аиРезультатыЗадачОбзвона.attemptNumber КАК attemptNumber,
		|	МИКО_аиРезультатыЗадачОбзвона.phone КАК phone,
		|	МИКО_аиРезультатыЗадачОбзвона.result КАК result,
		|	МИКО_аиРезультатыЗадачОбзвона.phoneId КАК ВсегоНомеров,
		|	МИКО_аиРезультатыЗадачОбзвона.linkedId КАК ВсегоВызовов,
		|	ВЫБОР
		|		КОГДА ""CreateTask"" = МИКО_аиРезультатыЗадачОбзвона.state И МИКО_аиРезультатыЗадачОбзвона.result = """"
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ВызовНеНачался,
		|	ВЫБОР
		|		КОГДА ""CreateTask"" = МИКО_аиРезультатыЗадачОбзвона.state
		|				ИЛИ МИКО_аиРезультатыЗадачОбзвона.result <> """"
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК ВызовИдет,
		|	ВЫБОР
		|		КОГДА МИКО_аиРезультатыЗадачОбзвона.Успешный = ЛОЖЬ
		|				И МИКО_аиРезультатыЗадачОбзвона.result <> """"
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Неудачный,
		|	ВЫБОР
		|		КОГДА МИКО_аиРезультатыЗадачОбзвона.Успешный
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Успешный
		|ИЗ
		|	РегистрСведений.МИКО_аиРезультатыЗадачОбзвона КАК МИКО_аиРезультатыЗадачОбзвона
		|ГДЕ
		|	МИКО_аиРезультатыЗадачОбзвона.Задача = &Задача
		|ИТОГИ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВсегоНомеров),
		|	КОЛИЧЕСТВО(ВсегоВызовов),
		|	СУММА(ВызовНеНачался),
		|	СУММА(ВызовИдет),
		|	СУММА(Неудачный),
		|	СУММА(Успешный)
		|ПО
		|	Задача";
	
	Запрос.УстановитьПараметр("Задача", Объект.Ссылка);	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ВсегоНомеров   = Объект.НомераТелефонов.Количество();
		ВызовНеНачался = ВсегоНомеров; 
	Иначе	
		ВыборкаЗадача = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаЗадача.Следующий() Цикл
		    ЗаполнитьЗначенияСвойств(ЭтаФорма, ВыборкаЗадача);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры 


&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	Если Лев(Данные, 1)<>"<" Тогда
    	Возврат;
	КонецЕсли;
	
	врДанные = РазобратьXML(Данные);	 
	event = врДанные.Получить("devent");
	Если event = "StartDial" Тогда
		_out_number = врДанные.Получить("_out_number");
		Статус = "Вызов...";
	ИначеЕсли event = "EndCall" Тогда	
		_out_number = врДанные.Получить("_out_number");  
		Статус = "Отработан";
	Иначе
		Возврат;
	КонецЕсли;  
	
	phoneId = МИКО_аиAPI.ПреобразоватьНомерДляСохранения(_out_number);	
	ДанныеНомера = Объект.НомераТелефонов.НайтиСтроки(Новый Структура("phoneId",phoneId));
	Если ДанныеНомера.Количество()=0 Тогда
	 	Возврат;
	КонецЕсли;	
	ДанныеНомера[0].Статус = Статус;
КонецПроцедуры


&НаКлиенте
// Парсинг XML сообщения, получение структуры атрибутов.
// 
Функция РазобратьОтветXML(Знач xmlText, Знач Имя = "generic")
	Ответ = РазобратьXML(xmlText,Имя);
	Массив = Ответ.Получить(Имя);	
	Если ТипЗнч(Массив) = Тип("Массив") И Массив.Количество()>0 Тогда
	 	Возврат Массив[0];
	Иначе	
		Возврат (Новый Соответствие);
	КонецЕсли; 
КонецФункции // РазобратьОтветXML()
&НаКлиенте
// Получение атрибутов XML узлов.
// Параметры
//   xmlText - строка: текст XML
//   ПарамИмя- имя узла, если указано, то при первом найденом узле функция вернет ответ завершив парсинг.
//
Функция РазобратьXML(Знач xmlText,парамИмя=Неопределено)
	Узлы = Новый Соответствие;
	
	// найдем начало
	ПозНач = Найти(xmlText, "<") - 1;
	xmlText = СокрЛП(Прав(xmlText, СтрДлина(xmlText) - ПозНач));

	xmlText = СтрЗаменить(xmlText,"'/","' /");
	xmlText = СтрЗаменить(xmlText,"""/>","' />");
	ДлинаСтроки = СтрДлина(xmlText);

	СимволыКонцаИмени = " />";
	ИмяНайдено = Ложь; ИмяЭлемента = ""; СтрокаАтрибутов = "";
	// пробуем получить все атрибуты 
	Для Итератор = 1 По ДлинаСтроки Цикл
		Символ = Сред(xmlText, Итератор, 1);
		
		Если Символ = "<" Тогда
		 	// начало нового элемента
			ИмяНайдено = Ложь; ИмяЭлемента = ""; СтрокаАтрибутов = "";
			Продолжить;
		ИначеЕсли Символ = ">" Тогда
			Атрибуты = ПолучитьАтрибуты(СтрокаАтрибутов);	
		ИначеЕсли ИмяНайдено = Ложь И Найти(СимволыКонцаИмени, Символ) > 0 Тогда 	
			ИмяНайдено = Истина;
			Продолжить;
		ИначеЕсли ИмяНайдено = Ложь Тогда
			
			ИмяЭлемента = ИмяЭлемента + Символ;
			Продолжить;					
		ИначеЕсли ИмяНайдено = Истина Тогда
			СтрокаАтрибутов = СтрокаАтрибутов + Символ;
			Продолжить;
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(ИмяЭлемента) Тогда
			// добавляем в результат разбора
			ДобавитьУзел(Узлы, НРег(ИмяЭлемента), Атрибуты);
			Если парамИмя=ИмяЭлемента Тогда
				Прервать;	
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла;
	
	Возврат Узлы;
КонецФункции // РазобратьXML()
&НаКлиенте
// Разбирает строку XML в соответсвие ключ - значение
//
Функция ПолучитьАтрибуты(Данные)
	
	Если СтрЧислоВхождений(Данные, "'") = 0 Тогда
		МассивПодстрок=РазложитьСтрокуВМассивПодстрок(Данные,""" ");
	Иначе
		МассивПодстрок=РазложитьСтрокуВМассивПодстрок(Данные,"' ");
	КонецЕсли; 
	
	СимволДвоеточиеПробел="=";
	
	ПараметрыОтвета=Новый Соответствие;
	Для сч=0 по МассивПодстрок.Количество()-1 Цикл
		СтрокаДляРазбора	= СокрЛП(МассивПодстрок[сч]);
		ПозицияРазделителя	= Найти(СтрокаДляРазбора,СимволДвоеточиеПробел);
		ДлинаСтроки			= СтрДлина(СтрокаДляРазбора);
		Если ПозицияРазделителя<>0 Тогда
			Параметр=Лев(СтрокаДляРазбора,ПозицияРазделителя-1);
			Значение=Прав(СтрокаДляРазбора,ДлинаСтроки-ПозицияРазделителя-1);
			Значение=Значение;
			ПараметрыОтвета.Вставить(Параметр,Значение);
		КонецЕсли;	
		
	КонецЦикла;	
	Возврат ПараметрыОтвета;
КонецФункции	
&НаКлиенте
// Добавляет в соотвествие "Узлы" набор атрибутов.
// 
Процедура ДобавитьУзел(Узлы, Знач Имя, Знач Атрибуты)
	Если НЕ ТипЗнч(Узлы) = Тип("Соответствие") Тогда
		Узлы = Новый Соответствие;
	КонецЕсли; 
	Если НЕ ЗначениеЗаполнено(Имя) Тогда
	 	Возврат;
	КонецЕсли; 
	Если НЕ ТипЗнч(Атрибуты) = Тип("Соответствие") Тогда
	 	Атрибуты = Новый Соответствие; 	
	КонецЕсли; 
	МассивАтр = Узлы.Получить(Имя);
	Если НЕ ТипЗнч(МассивАтр) = Тип("Массив") Тогда
		МассивАтр = Новый Массив;
	КонецЕсли; 	
	МассивАтр.Добавить(Атрибуты);
	Узлы.Вставить(Имя, МассивАтр);
КонецПроцедуры

&НаКлиенте
Функция РазложитьСтрокуВМассивПодстрок(Знач Стр, Разделитель = ",", ВключатьПустые = Истина) Экспорт
	Если СтрДлина(Разделитель) = 1 Тогда
		Попытка
			// Только 8.3.6.1977+
			МассивСтрок = Вычислить("СтрРазделить(Стр, Разделитель, ВключатьПустые)");
			Возврат МассивСтрок;
		Исключение
		КонецПопытки; 	
	КонецЕсли; 

	МассивСтрок = Новый Массив();
	Если Разделитель = " " Тогда
		Стр = СокрЛП(Стр);
		Пока Истина Цикл
			Поз = Найти(Стр,Разделитель);
			Если Поз=0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр,Поз-1));
			Стр = СокрЛ(Сред(Стр,Поз));
		КонецЦикла;
	Иначе
		ДлинаРазделителя = СтрДлина(Разделитель);
		Пока Истина Цикл
			Поз = Найти(Стр,Разделитель);
			Если Поз=0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			Если ЗначениеЗаполнено(Лев(Стр,Поз-1)) Тогда
				МассивСтрок.Добавить(Лев(Стр,Поз-1));
			ИначеЕсли ВключатьПустые = Истина Тогда	
				МассивСтрок.Добавить(Лев(Стр,Поз-1));
			КонецЕсли; 
			Стр = Сред(Стр,Поз+ДлинаРазделителя);
		КонецЦикла;
	КонецЕсли;
	
	Возврат МассивСтрок;
КонецФункции


&НаКлиенте
Процедура ПоРасписаниюПриИзменении(Элемент)	
	Элементы.грРасписаниеCЭлементы.Видимость = Объект.ПоРасписанию;
КонецПроцедуры

&НаКлиенте
Процедура timeCallAllowПриИзменении(Элемент)
	Для каждого ДанныеНомера Из Объект.НомераТелефонов Цикл
		ДанныеНомера.timeCallAllow = Объект.timeCallAllow;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьИзФайлаСервер(ИдентификаторВхранилище, ИмяФайла)
	ДанныеОбзвона = МИКО_аиAPI.ОтправитьФайлНаСервер(ИдентификаторВхранилище, ИмяФайла);	
    Если ТипЗнч(ДанныеОбзвона) = Тип("Массив") Тогда   
		Объект.НомераТелефонов.Очистить();
		Для каждого ДанныеКлиента Из ДанныеОбзвона Цикл                
		 	строкаНомера = Объект.НомераТелефонов.Добавить();
			строкаНомера.Номер = МИКО_аиAPI.УбратьИзСтрокиТелефонаВсеБуквы(ДанныеКлиента.Получить("number"));	
			строкаНомера.Клиент= ДанныеКлиента.Получить("clientId");	
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры // ЗагрузитьИзФайла()

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)   
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	Фильтр = "Excel (*.xls)|*.xls|Excel (*.xlsx)|*.xlsx";
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = "Выберите файл";
	ДанныеОбзвона = Неопределено;
	Если ДиалогОткрытияФайла.Выбрать() Тогда
	    МассивФайлов = ДиалогОткрытияФайла.ВыбранныеФайлы;
	    Для Каждого ИмяФайла Из МассивФайлов Цикл
			ИдентификаторВхранилище = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ИмяФайла)); 
			ЗагрузитьИзФайлаСервер(ИдентификаторВхранилище, ИмяФайла);		
			прервать;	
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатистику(Команда)
	ОбновитьСтатистикуПоЗвонку(Истина);	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодключитьОбработчикОжидания("ОбновитьСтатистикуПоЗвонкуКлиент", 5);	
КонецПроцедуры


&НаКлиенте
Процедура ОстановитьОбзвонДляНомера(Команда)
	ТекущиеДанные = Элементы.НомераТелефонов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
	 	Возврат;
	КонецЕсли;
	МИКО_аиAPI.ПрекратитьВызовыПоНомеру(ТекущиеДанные.Номер, Объект.ИдентификаторЗадачи);
КонецПроцедуры
